1. 성에 대소문자 무관하게 z가 포함된 성을 가진 사원들이 모두 몇명인지 파악하고자 한다.
성에 대소문자 무관하게 z가 포함된 성을 가진 사원들의 수를 조회하시오.
   
2. 우리회사 사원들 최고급여와 최저급여 간 급여차를 파악하고자 한다.
우리회사 최고급여와 최저급여의 급여차를 조회하시오.

3. 우리회사에 매니저로 있는 사원들의 수를 파악하고자 한다.
우리회사 매니저인 사원들의 수를 조회하시오.

4. 우리회사 account 업무를 하는 사원들의 급여평균를 조회하시오.

--------------------------------------------------------------
[연습문제 4-2]
1. 우리회사 사원들 중 커미션을 받는 사원들이 모두 몇명인지 파악하고자 한다.
커미션을 받는 사원의 수를 조회

2. 우리회사 사원들 중 가장 먼저/나중에 입사한 사원의 입사일자 조회

3. 우리회사 부서코드 90번인 부서에 속한 사원들의 급여평균 조회
단, 급여평균액은 소수 둘째자리까지 반올림 표기





-----------------------------------------------------------------------------------------------
