[ 연습문제 5-1 ]                                                                             
1. 이름에 소문자 v가 포함된 모든 사원의 사번, 이름, 부서명을 조회하는 쿼리문을 작성한다.


2. 커미션을 받는 사원의 사번, 이름, 급여, 커미션 금액, 부서명을 조회하는 쿼리문을 작성한다.
   단, 커미션 금액은 월급여에 대한 커미션 금액을 나타낸다.


3. 각 부서의 부서코드, 부서명, 위치코드, 도시명, 국가코드, 국가명을 조회하는 쿼리문을 작성한다.


4. 사원의 사번, 이름, 업무코드, 매니저의 사번, 매니저의 이름, 매니저의 업무코드를 조회하여 
사원의 사번 순서로 정렬하는 쿼리문을 작성한다.


5. 모든 사원의 사번, 이름, 부서명, 도시, 주소 정보를 조회하여 사번 순으로 정렬하는 쿼리문을 작성한다.

-----------------------------------------------------------------------------------------------
실습
1. 모든 사원의 사번, 성명, 업무코드, 매니저사번, 매니저성명, 매니저의 업무코드 조회하여
사번 순으로 정렬 --SELF JOIN


2. 성이 King인 사원들의 사번, 성명, 부서코드, 부서명 조회


3. 위치코드가 1400 인 도시에는 어느 부서가 있나 파악하고자 한다.
위치코드가 1400 인 도시명, 부서명 조회


4. 위치코드 1800 인 곳에 근무하는 사원들의
사번, 성명, 업무코드, 급여, 부서명, 위치코드 조회


5. 자신의 매니저보다 먼저 입사한 사원들의 
사번, 성명, 입사일자, 매니저성명, 매니저 입사일자 조회 --SELF JOIN


6. toronto 에 근무하는 사원들의
사번, 성, 업무코드, 부서코드, 부서명, 도시 조회


7. 커미션을 받는 모든 사원들의 성, 부서명, 위치코드, 도시 조회
-----------------------------------------------------------------------------------------------